import React, { Component } from 'react';

import Slider from 'react-slick';
import { Container, Row } from 'react-bootstrap';

class Reviews extends Component {
  state = {
    reviews: [
      {
        name: 'Наталія',
        age: 25,
        text: 'Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування. Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування.',
      },
      {
        name: 'Василь',
        age: 18,
        text: 'Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування. Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування.',
      },
    {
      name: 'Іра',
      age: 30,
      text: 'Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування. Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування.',
      },
      {
        name: 'Іван',
        age: 40,
        text: 'Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування. Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування.',
      },
      {
        name: 'Олеся',
        age: 35,
        text: 'Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування. Хороший відпочинок починається з планування. А планування вимагає часу, знань і досвіду. Ми гарантуємо вам задоволення не тільки від відпочинку, але ще до того, від процесу його планування.',
      },
    ]
  }
  render() {
    var settings = {
      dots: false,
      speed: 500,
      infinite: true,
      swipeToSlide: false,
      slidesToShow: 3,
      slidesToScroll: 1,
      adaptiveHeight: true,
      responsive: [
      {
          breakpoint: 1024,
          settings: {
          slidesToShow: 2,
          slidesToScroll: 2,
          arrows: false,
          dots: true,
          }
      },
      {
          breakpoint: 600,
          settings: {
          slidesToShow: 1,
          slidesToScroll: 1,
          arrows: false,
          dots: true,
          }
      },
      ],
    };
    return (
      <>
        <div className="reviews">
          <Container>
            <div className="reviews__inner">
              <h3 className="reviews__title">Відгуки туристів</h3>
              <Row>
                <Slider {...settings}>
                  {this.state.reviews.map((item, index) =>
                    <div className="reviews__wrapper" key={index}>
                      <div className="reviews__card">
                        <h4 className="reviews__name">{item.name} ({item.age})</h4>
                        <p className="reviews__text">{item.text}</p>
                      </div>
                    </div>
                  )}
                </Slider>
              </Row>
            </div>
          </Container>
        </div>
      </>
    )
  }
}

export default Reviews;
